trade_exp/src/DataProcessors/ПодборТоваровВДокументПродажи/ПодборТоваровВДокументПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПодборТоваровВДокументПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>Корзина</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ABCКлассификацияНоменклатуры_Альтерра/ABCКлассификацияНоменклатуры_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ABCКлассификацияНоменклатуры_Альтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Класс</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="80d8f3a4-6b7b-4718-8ee3-b7242a527914">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АналогиНоменклатуры/АналогиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8fdb01f6-4967-4863-8211-300891e04633">
  <name>АналогиНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="5101c189-e0d9-4d7a-ad43-75fe9ff7c368">
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c8b16b72-9107-42cd-bc6b-e7ed0308c512">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ed55715d-dbff-4f56-9d3f-c1366a117f76">
    <name>ОбратнаяАналогия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="56dd2c22-0fcc-4868-b308-1d6f8a56ed55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ed23a32e-e185-4b37-b18e-204672040e54">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8754e396-036b-4c70-867f-6bf8ed950029">
    <name>АналогНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="26f13074-bd31-45ce-8888-d525330b5e0b">
    <name>АналогХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/Неликвиды/Неликвиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6135d411-f6c1-4357-98b2-8efecc3556b2">
  <name>Неликвиды</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="1d5252ff-fc63-4e13-9707-bb7deec18032">
    <name>Ликвидность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="8808cf9a-cb1b-4ca8-a2ac-e01687e6c2f9">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="a0e4f1bf-e5ec-49fc-a362-54516c94aadb">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="abb41226-3835-47ce-8649-d3ec24658d9d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2789d090-8df4-4ecb-9284-5e015e1aacd3">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/DataProcessors/ПодборТоваровВДокументПродажи/Forms/Форма/Module.bsl
&НаСервере
Процедура Обр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	МодифицироватьЗапрос();
	Элементы.КорзинаВидЦены.ТолькоПросмотр = Не ПроверкиАльтерраСервер.ИмеетПолныеПрава();
	Если Параметры.Свойство("СтруктураКлиента") Тогда
		_СтруктураКлиента = Параметры.СтруктураКлиента;
	КонецЕсли;	
	
	Элементы.ОстаткиТоваров.Видимость = Истина;
	Элементы.ОтображатьОстаткиНадпись.Видимость = Истина;

КонецПроцедуры

&НаСервере
Процедура МодифицироватьЗапрос()
	
	Если Не ПустаяСтрока(СписокНоменклатура.ТекстЗапроса) Тогда
		Если СтрНайти(СписокНоменклатура.ТекстЗапроса, "ABCКлассификацияНоменклатуры_Альтерра") = 0 Тогда 
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(СписокНоменклатура.ТекстЗапроса);  
			
			
			ПакетЗапроса = СхемаЗапроса.ПакетЗапросов.Количество()-1;
			ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[ПакетЗапроса];
			ОператорВыбора = ЗапросВыбора.Операторы[0];
			
			НовыйИсточник = ОператорВыбора.Источники.Добавить("РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.СрезПоследних","ABCКлассификацияНоменклатуры_АльтерраСрезПоследних");
			
			НовыйИсточник.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
			Условие = Новый ВыражениеСхемыЗапроса("СправочникНоменклатура.Ссылка = ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Номенклатура");
			НовыйИсточник.Соединения[0].Условие = Условие;
			
			НовыйИсточник.Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса("Подразделение=&Подразделение") ;
			
			ОператорВыбора.ВыбираемыеПоля.Добавить("ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Класс");
			 
			Если найти(СписокНоменклатура.ТекстЗапроса,"&Склад") > 0 тогда
				НовыйИсточник = ОператорВыбора.Источники.Добавить("РегистрНакопления.ТоварыКОтгрузке.Остатки","ТоварыКОтгрузке");
				Условие = Новый ВыражениеСхемыЗапроса("СправочникНоменклатура.Ссылка = ТоварыКОтгрузке.Номенклатура");
				НовыйИсточник.Соединения[0].Условие = Условие;
				НовыйИсточник.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
				НовыйИсточник.Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса("Склад в (&Склад)") ;
				
				стрпоиска = "ВЫРАЗИТЬ(ЕСТЬNULL(ВсеОстатки.ВНаличии, 0) /";
				стрзамены = "ВЫРАЗИТЬ((ЕСТЬNULL(ВсеОстатки.ВНаличии, 0) + ЕСТЬNULL(ТоварыКОтгрузке.КОтгрузкеОстаток, 0)) /";
				
				СписокНоменклатура.ТекстЗапроса = стрзаменить(СхемаЗапроса.ПолучитьТекстЗапроса(), стрпоиска, стрзамены);
			Иначе
				СписокНоменклатура.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
			КонецЕсли;
			СписокНоменклатура.Параметры.УстановитьЗначениеПараметра("Подразделение", Склад.Подразделение);
		КонецЕсли;  
		
		//новое ценообразование
		Если ДопМодуль.НовоеЦенообразование() Тогда     
			Если ЭтаФорма.ВидыЦен.Количество() = 0 Тогда
				ВидыЦенПараметр = Справочники.ВидыЦен.ПустаяСсылка();
			ИначеЕсли ЭтаФорма.ВидыЦен.Количество() = 1 Тогда
				ВидыЦенПараметр = ЭтаФорма.ВидыЦен[0].Значение;
			Иначе
				ВидыЦенПараметр = ЭтаФорма.ВидыЦен.ВыгрузитьЗначения();
			КонецЕсли;

				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ВидыЦен", ВидыЦенПараметр);
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "ФорматПодразделения", Подразделение.ФорматПодразделения);
				ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "РегионПрисутствия", Подразделение.РегионПрисутствия);
		КонецЕсли;	
		
		ДобавитьОтборПоСегменту();
	КонецЕсли; 
	
КонецПроцедуры

#Область ИзменениеПодбора

&НаСервере
Процедура ПоискПоПодстрокеНаКлиенте()
	
	Использование = ЗначениеЗаполнено(СтрокаПоискаНоменклатура);
	
	Если Использование Тогда
		ШаблонПоиска = СокрЛП(СтрокаПоискаНоменклатура);
		
		МассивОтбора = Новый СписокЗначений();	
		МассивСлов = мРазложитьСтрокуВМассивПодстрок(ШаблонПоиска," ");
		МассивСлов = ПеревестиВРег(МассивСлов);
		КоличествоСлов = МассивСлов.Количество();
		
		Если КоличествоСлов > 0 Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	Номенклатура.Наименование,
			|	Номенклатура.Артикул,
			|	Номенклатура.Код
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	(Номенклатура.Наименование ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Артикул ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Код ПОДОБНО &ШаблонПоиска)
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";	
			
			//Попытка найти по первому слову но его может и не быть.
			ПодстрокаПоиска = СокрЛП(МассивСлов[0]);
			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;							
			Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
			ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
			
			//Попытка найти по второму слову
			Попытка
				Если ТаблицаТоваров.Количество() = 0 Тогда
					ПодстрокаПоиска = СокрЛП(МассивСлов[1]);
					
					Запрос = Новый Запрос();
					Запрос.Текст = ТекстЗапроса;							
					Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
					ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если ТаблицаТоваров.Количество() > 0 Тогда
				Для Каждого СтрЭлемент Из ТаблицаТоваров Цикл
					НаименованиеНоменклатуры = ВРег(СокрЛП(СтрЭлемент.Наименование));
					Артикул = ВРег(СокрЛП(СтрЭлемент.Артикул));
					Код = Врег(СокрЛП(СтрЭлемент.Код));
					КоличествоСовпаденийСлов = 0;
					Для Каждого ПодстрокаПоиска Из МассивСлов Цикл				
						НомерСовпадения = Найти(НаименованиеНоменклатуры, ПодстрокаПоиска);
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Артикул, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Код, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения > 0 Тогда						
							КоличествоСовпаденийСлов = КоличествоСовпаденийСлов + 1;
							Если КоличествоСовпаденийСлов = КоличествоСлов Тогда
								МассивОтбора.Добавить(СтрЭлемент.Номенклатура);
							КонецЕсли;					
						КонецЕсли;
					КонецЦикла;			
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;	
		
		Если МассивОтбора.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			СписокНоменклатура.Отбор,
			"Ссылка",
			МассивОтбора,
			ВидСравненияКомпоновкиДанных.ВСписке,,Использование);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокНоменклатура.Отбор,
		"Ссылка",
		Неопределено,
		ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	КонецЕсли;
	СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоискаНоменклатура.СписокВыбора, СтрокаПоискаНоменклатура);

КонецПроцедуры

&НаСервере
Процедура Обр_ВыполнитьПоискНоменклатурыНаСервере() 
	
	Использование = ЗначениеЗаполнено(СтрокаПоискаНоменклатура);
	
	Если Использование Тогда
		ШаблонПоиска = СокрЛП(СтрокаПоискаНоменклатура);
		
		МассивОтбора = Новый СписокЗначений();	
		МассивСлов = мРазложитьСтрокуВМассивПодстрок(ШаблонПоиска," ");
		МассивСлов = ПеревестиВРег(МассивСлов);
		КоличествоСлов = МассивСлов.Количество();
		
		Если КоличествоСлов > 0 Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	Номенклатура.Наименование,
			|	Номенклатура.Артикул,
			|	Номенклатура.Код
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	(Номенклатура.Наименование ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Артикул ПОДОБНО &ШаблонПоиска
			|			ИЛИ Номенклатура.Код ПОДОБНО &ШаблонПоиска)
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";	
			//-
			
			//Попытка найти по первому слову но его может и не быть.
			ПодстрокаПоиска = СокрЛП(МассивСлов[0]);
			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;							
			Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
			ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
			
			//Попытка найти по второму слову
			Попытка
				Если ТаблицаТоваров.Количество() = 0 Тогда
					ПодстрокаПоиска = СокрЛП(МассивСлов[1]);
					
					Запрос = Новый Запрос();
					Запрос.Текст = ТекстЗапроса;							
					Запрос.УстановитьПараметр("ШаблонПоиска","%"+ПодстрокаПоиска+"%");
					ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если ТаблицаТоваров.Количество() > 0 Тогда
				Для Каждого СтрЭлемент Из ТаблицаТоваров Цикл
					НаименованиеНоменклатуры = ВРег(СокрЛП(СтрЭлемент.Наименование));
					Артикул = ВРег(СокрЛП(СтрЭлемент.Артикул));
					Код = Врег(СокрЛП(СтрЭлемент.Код));
					КоличествоСовпаденийСлов = 0;
					Для Каждого ПодстрокаПоиска Из МассивСлов Цикл				
						НомерСовпадения = Найти(НаименованиеНоменклатуры, ПодстрокаПоиска);
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Артикул, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения = 0 Тогда
							НомерСовпадения = Найти(Код, ПодстрокаПоиска);
						КонецЕсли;
						Если НомерСовпадения > 0 Тогда						
							КоличествоСовпаденийСлов = КоличествоСовпаденийСлов + 1;
							Если КоличествоСовпаденийСлов = КоличествоСлов Тогда
								МассивОтбора.Добавить(СтрЭлемент.Номенклатура);
							КонецЕсли;					
						КонецЕсли;
					КонецЦикла;			
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;	
		
		Если МассивОтбора.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			СписокНоменклатура.Отбор,
			"Ссылка",
			МассивОтбора,
			ВидСравненияКомпоновкиДанных.ВСписке,,Использование);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокНоменклатура.Отбор,
		"Ссылка",
		Неопределено,
		ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	КонецЕсли;
	СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.СтрокаПоискаНоменклатура.СписокВыбора, СтрокаПоискаНоменклатура);
	
КонецПроцедуры

&НаСервере
Функция ПеревестиВРег(МассивСлов)
	
	НовыйМассив = Новый Массив; 
	
	Для Каждого Стр Из МассивСлов Цикл
		НовыйМассив.Добавить(ВРег(СокрЛП(Стр)));
	КонецЦикла;
	
	Возврат НовыйМассив; 
	
КонецФункции

&НаСервере
Функция мРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ";")
	
	МассивСтрок = Новый Массив();
	
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;		
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз - 1));
			Стр = Сред(Стр,Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура Обр_СтрокаПоискаНоменклатураПриИзмененииВместо(Элемент)
	
	// +Альтерра
	Обр_ВыполнитьПоискНоменклатурыНаСервере();
	ПодборТоваровКлиент.ПослеВыполненияПоискаНоменклатуры(ЭтаФорма);
	// -    
	
КонецПроцедуры

&НаКлиенте
Процедура Обр_СтрокаПоискаНоменклатураОчисткаВместо(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаПоискаНоменклатура = "";
	
	// +Альтерра
	Обр_ВыполнитьПоискНоменклатурыНаСервере();  
	// -    
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Обр_ИспользоватьФильтрыПриИзмененииПосле(Элемент)
	МодифицироватьЗапрос();
КонецПроцедуры

&НаКлиенте
Процедура Обр_СегментНоменклатурыПриИзмененииПеред(Элемент)
	ДобавитьОтборПоСегменту();
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборПоСегменту()
	
	СтрокаУсловия = "
	|1 В
	|(ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК Сегменты
	|ГДЕ
	|	Сегменты.Номенклатура = СправочникНоменклатура.Ссылка
	|	И Сегменты.Сегмент = &СегментНоменклатуры)";
	
	СхемаЗапроса= Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(СписокНоменклатура.ТекстЗапроса);
//	ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[0]; 
	ПакетЗапроса = СхемаЗапроса.ПакетЗапросов.Количество()-1;
	ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[ПакетЗапроса];
	ОператорВыбора = ЗапросВыбора.Операторы[0];
	Если ЗначениеЗаполнено(СегментНоменклатуры) Тогда	
		ОператорВыбора.Отбор.Добавить(СтрокаУсловия);
		
		СписокНоменклатура.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();			
		ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "СегментНоменклатуры", СегментНоменклатуры, ЗначениеЗаполнено(СегментНоменклатуры));
	Иначе
		Условие = ОператорВыбора.Отбор.Найти(СтрокаУсловия);	
		Если Условие <> Неопределено Тогда
			Индекс = ОператорВыбора.Отбор.Индекс(Условие);
			ОператорВыбора.Отбор.Удалить(Индекс);
			СписокНоменклатура.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область СохранениеСегмента

&НаСервере
Процедура Обр_ПриОткрытииПослеНаСервере()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодборТоваровВДокументПродажи_Форма","Настройки",СтруктураНастроек);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураНастроек); 
	
КонецПроцедуры

&НаКлиенте
Процедура Обр_ПриОткрытииПосле(Отказ)
	
	Обр_ПриОткрытииПослеНаСервере();
	Если ЗначениеЗаполнено(СегментНоменклатуры) Тогда
		ДобавитьОтборПоСегменту();
	КонецЕсли;    
	
КонецПроцедуры

&НаСервере
Процедура Обр_ПередЗакрытиемПослеНаСервере()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СегментНоменклатуры", СегментНоменклатуры);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодборТоваровВДокументПродажи_Форма","Настройки",СтруктураНастроек);
	Если значениезаполнено(_СтруктураКлиента) Тогда
		Если _НехваткаТовара.Количество() > 0 Тогда
			УстановитьПривилегированныйРежим(Истина);
			Попытка 
				ДокументНехватки = Документы.НехваткаТовара.СоздатьДокумент();
				ДокументНехватки.Дата = ТекущаяДата();
				ДокументНехватки.Менеджер = Пользователи.ТекущийПользователь();
				ДокументНехватки.Склад = Объект.Склад;
				ДокументНехватки.Клиент = _СтруктураКлиента.Партнер;
				ДокументНехватки.Контрагент = _СтруктураКлиента.Контрагент;
				ДокументНехватки.Товары.Загрузить(_НехваткаТовара.Выгрузить());
				ДокументНехватки.Записать();
				_НехваткаТовара.Очистить();
				Документы.НехваткаТовара.СоздатьСообщениеВБитрихПоДокументуНехватки(ДокументНехватки);
			Исключение
				_НехваткаТовара.Очистить();
				Информация = ИнформацияОбОшибке();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = КраткоеПредставлениеОшибки(Информация);
				Сообщение.Сообщить();
				ТекстОшибки = ПодробноеПредставлениеОшибки(Информация);
			КонецПопытки;	
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;	
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура Обр_ПередЗакрытиемПосле(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Обр_ПередЗакрытиемПослеНаСервере();
КонецПроцедуры
#КонецОбласти

#Область Аналоги

&НаКлиенте
Процедура Обр_СписокСтандартныйПоискНоменклатураПриАктивизацииСтрокиПосле(Элемент)
	
	Если _ПоказыватьАналоги И Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьАналогиСервер(Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные.Номенклатура);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАналогиСервер(Номенклатура)
	
	_Аналоги.Очистить();
	
	Если Номенклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ВидыЦен.Количество() > 0 Тогда
		ВидЦеныП = ВидыЦен[0].Значение;
	Иначе
		ВидЦеныП = ВидЦены;
	КонецЕсли;
	
	_Аналоги.Загрузить(РегистрыСведений.АналогиНоменклатуры.ПолучитьАналогиНоменклатуры(Номенклатура,ВидЦеныП,Склад));
	
КонецПроцедуры

&НаКлиенте
Процедура Обр_СписокРасширенныйПоискНоменклатураПриАктивизацииСтрокиПосле(Элемент)
	
	Если _ПоказыватьАналоги И Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьАналогиСервер(Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обр__АналогиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;
	
	СтараяТекСтрока = ТекущаяСтрокаНоменклатуры;
	
	Если ТекущаяСтрокаНоменклатуры.ХарактеристикиИспользуются Тогда
		Обр__ПерейтиКХарактеристикамНоменклатурыПослеНаСервере(Элементы._Аналоги.ТекущиеДанные.Номенклатура);
		Элементы.СтраницыАналогов.ТекущаяСтраница = Элементы.СтраницаАналогиХарактеристик;
	Иначе
		ТекущаяСтрокаНоменклатуры = ПодборТоваровКлиентСервер.СтруктураСтрокиНоменклатуры();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрокаНоменклатуры, Элемент.ТекущиеДанные);
		
		ПодборТаблицаНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Неопределено, СтандартнаяОбработка);
		ТекущаяСтрокаНоменклатуры = СтараяТекСтрока;
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура Обр__ПерейтиКХарактеристикамНоменклатурыПослеНаСервере(Номенклатура)	

	Запрос = Новый Запрос;   
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
	|	ХарактеристикиНоменклатуры.Владелец.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	&ВидЦены КАК ВидЦены,
	|	&Склад КАК Склад,
	|	ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(РаспределениеЗапасов.ВНаличии, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) КАК Доступно,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	НЕОПРЕДЕЛЕНО КАК ВладелецХарактеристик,
	|	ИСТИНА КАК ХарактеристикиИспользуются,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка) КАК ВариантРасчетаЦеныНабора,
	|	ЛОЖЬ КАК СодержитТовары,
	|	ЛОЖЬ КАК СодержитУслуги
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ХарактеристикиНоменклатуры.Владелец = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = ЦеныНоменклатурыСрезПоследних.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|			ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК ВНаличии,
	|			СУММА(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Резерв
	|		ИЗ
	|			РегистрНакопления.ЗапасыИПотребности.Остатки(
	|					,
	|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						И Склад = &Склад) КАК ЗапасыИПотребностиОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗапасыИПотребностиОстатки.Номенклатура,
	|			ЗапасыИПотребностиОстатки.Характеристика) КАК РаспределениеЗапасов
	|		ПО ХарактеристикиНоменклатуры.Владелец = РаспределениеЗапасов.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = РаспределениеЗапасов.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
	|		ПО ХарактеристикиНоменклатуры.Владелец = ТоварыКОтгрузкеОстатки.Номенклатура
	|			И ХарактеристикиНоменклатуры.Ссылка = ТоварыКОтгрузкеОстатки.Характеристика
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
	Если ВидыЦен.Количество() > 0 Тогда
		ВидЦеныП = ВидыЦен[0].Значение;
	Иначе
		ВидЦеныП = ВидЦены;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦеныП);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	_АналогиХарактеристики.Загрузить(Рез);
	
КонецПроцедуры

&НаКлиенте
Процедура Обр__ПерейтиКСпискуАналогиПосле(Команда)
	Элементы.СтраницыАналогов.ТекущаяСтраница = Элементы.СтраницаАналогиНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура Обр__АналогиХарактеристикиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтараяТекСтрокаХарактеристика = ТекущаяСтрокаХарактеристик;
	
	ТекущаяСтрокаХарактеристик = ПодборТоваровКлиентСервер.СтруктураСтрокиХарактеристик();
	ЗаполнитьЗначенияСвойств(ТекущаяСтрокаХарактеристик, Элемент.ТекущиеДанные);
	
	ПодборТаблицаХарактеристикиВыбор(Элемент, ВыбраннаяСтрока, Неопределено, СтандартнаяОбработка);
	ТекущаяСтрокаХарактеристик = СтараяТекСтрокаХарактеристика;	        
	
КонецПроцедуры

&НаКлиенте
Процедура Обр__ОткрытьКарточкуПосле(Команда)

	ТекущаяСтрока = ЭтаФорма.Элементы._Аналоги.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ТекущаяСтрока.Номенклатура);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);  
	
КонецПроцедуры

&НаКлиенте
Процедура Обр__ПоказыватьАналогиПриИзмененииПосле(Элемент)
	Элементы.СтраницыАналогов.Видимость = _ПоказыватьАналоги; 
КонецПроцедуры

#КонецОбласти


#Область ПоказатьРезервы
&НаКлиенте
Процедура Ном_ПоказатьРезервы(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элементы[ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(ЭтаФорма)].ТекущаяСтрока);
	ПараметрыФормы.Вставить("Склад",Объект.Склад);
	ОткрытьФорму("ОбщаяФорма.ФормаРезервыПоСкладам", ПараметрыФормы, ЭтаФорма); 
	
КонецПроцедуры

#КонецОбласти

#Область Нехватка

&НаКлиенте
Процедура Док__ДобавитьНехваткуТовараПосле(Команда)
	
	ПараметрыФормы = Новый Структура;
	ДанныеСтроки = Элементы[ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(ЭтаФорма)].ТекущиеДанные;
	ПараметрыФормы.Вставить("Номенклатура",ДанныеСтроки.Номенклатура );
	ПараметрыФормы.Вставить("Остаток", ДанныеСтроки.Доступно);
	ПараметрыФормы.Вставить("КлассТовара", ДанныеСтроки.Класс);
	ПараметрыФормы.Вставить("Ликвидность", ВернутьЛиквидность(ДанныеСтроки.Номенклатура,Склад));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКоличестваНехватки", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.ЗапросКоличестваНехватки",ПараметрыФормы,,,,,ОписаниеОповещения);	

КонецПроцедуры

&НаСервере
Функция ВернутьЛиквидность(Номенклатура,Склад)
	
	Если значениезаполнено(склад) Тогда
		Возврат РегистрыСведений.Неликвиды.ВернутьЛиквидностьТовара(Номенклатура,Склад.Подразделение);
	КонецЕсли;	
	Возврат Перечисления.Ликвидность.ПустаяСсылка(); 
	
конецфункции	

&НаКлиенте
Процедура ПослеВыбораКоличестваНехватки(Результат,ДопПараметры) Экспорт

	ПослеВыбораКоличестваНехваткиСервер(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораКоличестваНехваткиСервер(Результат)

	Если Результат <> Неопределено Тогда 
		СтрокаТаблицы = _НехваткаТовара.Добавить();
		заполнитьЗначенияСвойств(СтрокаТаблицы,Результат);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти     

// новое ценообразование
&Вместо ("ЗаполнитьЦеныПоСоглашениюСервер")
Функция Док_ЗаполнитьЦеныПоСоглашениюСервер(ПоВсемСтрокам = Ложь)
	
	Если ПоВсемСтрокам Тогда
		МассивСтрок = Неопределено;
	Иначе
		МассивСтрок = Новый Массив;
		Для Каждого Строка Из Элементы.Корзина.ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(Объект.Корзина.НайтиПоИдентификатору(Строка));
		КонецЦикла;
	КонецЕсли;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(Объект.Корзина, МассивСтрок);
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	
	ПараметрыЗаполненияЦен = Новый Структура;
	ПараметрыЗаполненияЦен.Вставить("Дата",               Дата);
	ПараметрыЗаполненияЦен.Вставить("Валюта",             Валюта);     
	ПараметрыЗаполненияЦен.Вставить("Партнер",            Партнер);
	ПараметрыЗаполненияЦен.Вставить("Соглашение",         Соглашение);
	ПараметрыЗаполненияЦен.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ПараметрыЗаполненияЦен.Вставить("ВозвращатьМногооборотнуюТару", ВозвращатьМногооборотнуюТару);
	ПараметрыЗаполненияЦен.Вставить("Организация",        Организация);
	ПараметрыЗаполненияЦен.Вставить("РассчитыватьНаборы", Истина);    
	// +Альтерра
	ПараметрыЗаполненияЦен.Вставить("ПоляЗаполнения",	  "Цена, СтавкаНДС, ВидЦены, СрокПоставки");    
	// ПараметрыЗаполненияЦен.Вставить("ПоляЗаполнения",     "Цена, ВидЦены, СрокПоставки");
	// -
	
	// +Альтерра
	Если ДопМодуль.НовоеЦенообразование() Тогда
		ПараметрыЗаполненияЦен.Вставить("Подразделение", Подразделение);
	КонецЕсли;	
	// -
	
	ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
		Объект.Корзина,
		МассивСтрок, // Массив строк или структура отбора
		ПараметрыЗаполненияЦен, // Параметры заполнения
		СтруктураДействий);
	
	ПодборТоваровКлиентСервер.УстановитьТекстИнформационнойНадписи(ЭтаФорма);
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("ДополнитьСтруктуруДействиямиРасчетаЦены")
Процедура Док_ДополнитьСтруктуруДействиямиРасчетаЦены(Объект, СтруктураДействий, ТекущаяСтрока)

	ОписаниеОбъекта = Новый Структура;
	ОписаниеОбъекта.Вставить("Дата", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, Объект.ТекущаяДатаСеанса));
	ОписаниеОбъекта.Вставить("Валюта", Объект.Валюта);
	ОписаниеОбъекта.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	Если Объект.ВидыЦен.Количество() И ЗначениеЗаполнено(Объект.ВидыЦен[0].Значение) Тогда
		ОписаниеОбъекта.ВидЦены = Объект.ВидыЦен[0].Значение;
	КонецЕсли;
	ОписаниеОбъекта.Вставить("Партнер",    Объект.Партнер);
	ОписаниеОбъекта.Вставить("Соглашение", Объект.Соглашение);
	ОписаниеОбъекта.Вставить("Ссылка",     Неопределено);
	
	#Вставка
    ОписаниеОбъекта.Вставить("Подразделение",Объект.Подразделение);
    #КонецВставки
	Если Объект.ЕдинственныйВидЦенПродажи Тогда

		СтруктураЗаполненияЦены = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(ОписаниеОбъекта, Истина);
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);

	ИначеЕсли Объект.ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) 
		Или Не Объект.ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Партнер) И Объект.ИспользоватьПартнеровИКонтрагентов Тогда
		
		СтруктураЗаполненияУсловийПродажи = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(ОписаниеОбъекта);
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", СтруктураЗаполненияУсловийПродажи);
		
	ИначеЕсли Объект.РежимОтбораДляРозничныхПродаж Тогда

		СтруктураЗаполненияУсловийРозничнойПродажи = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийРозничныхПродажВСтрокеТЧ(ОписаниеОбъекта, Объект.ОбъектХраненияУсловийПродаж);
		СтруктураДействий.Вставить("ЗаполнитьУсловияРозничныхПродаж", СтруктураЗаполненияУсловийРозничнойПродажи);

	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены)
				Или ЦенообразованиеВызовСервера.НеобходимПересчетЦеныПриИзменении(ТекущаяСтрока.Номенклатура, "Серия", Неопределено) Тогда
		
		СтруктураЗаполненияЦены = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(ОписаниеОбъекта, Истина);
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураЗаполненияЦены);
	
	КонецЕсли;

КонецПроцедуры
